dag_logs/execution_dag_20250708_120249.mmd
graph TD
    BOOTSTRAP[BOOTSTRA...<br/>SYSTEM]
    sentinel_instance_01[sentinel...<br/>COMPONENT]:::component
    quantifier_agent_primary[quantifi...<br/>COMPONENT]:::component
    SEED_EXEC_test_iter1[SEED_EXE...<br/>SEED_EXECUTION]
    8554b35e_19a2_41f6_95e2_a95551ad7ca5[8554b35e...<br/>SEED_IDEA]:::seed
    ed7ffedb_5e16_4747_9ab5_4ac2f7162a47[ed7ffedb...<br/>GENERATED_IDEA]:::idea
    d67bd81f_f7ac_487f_beb6_c30897c2f5fb[d67bd81f...<br/>GENERATED_IDEA]:::idea
    e7b8a30d_31a5_4a69_858d_f7ddec3cdd00[e7b8a30d...<br/>GENERATED_IDEA]:::idea
    SEED_EXEC_test_iter2[SEED_EXE...<br/>SEED_EXECUTION]
    7812edff_fea4_44db_a49a_3f667fac0a5e[7812edff...<br/>SEED_IDEA]:::seed
    SEED_EXEC_test_iter3[SEED_EXE...<br/>SEED_EXECUTION]
    aba35ab9_c360_43e4_911a_6a153bb51778[aba35ab9...<br/>SEED_IDEA]:::seed
    SEED_EXEC_test_iter4[SEED_EXE...<br/>SEED_EXECUTION]
    1b1a541b_1452_46e7_8e7c_42d4e337a3cc[1b1a541b...<br/>SEED_IDEA]:::seed
    SEED_EXEC_test_iter5[SEED_EXE...<br/>SEED_EXECUTION]
    9a812053_6483_43a6_8622_c411f5b079e3[9a812053...<br/>SEED_IDEA]:::seed
    5ffd6e89_af76_4384_a163_89ac71872059[5ffd6e89...<br/>GENERATED_IDEA]:::idea
    ba8ab85d_b887_424f_8e4f_e2aa74128aa9[ba8ab85d...<br/>GENERATED_IDEA]:::idea
    fbbc3167_fd49_4182_94e6_80e630adc60e[fbbc3167...<br/>GENERATED_IDEA]:::idea
    617791d6_8424_46ee_b794_6ea8decc058d[617791d6...<br/>GENERATED_IDEA]:::idea
    3cfb18b4_6b1e_4f20_ba02_3a32516ae88e[3cfb18b4...<br/>GENERATED_IDEA]:::idea
    29ed6bde_747a_471f_9aee_438581f65b94[29ed6bde...<br/>GENERATED_IDEA]:::idea
    6a983762_843c_4568_b0bd_ee52367c0b4b[6a983762...<br/>GENERATED_IDEA]:::idea
    b4be9432_9ae9_4142_9ae3_6b9ae6fc924f[b4be9432...<br/>GENERATED_IDEA]:::idea
    1b3da0f2_3373_4753_a9f1_2d3ac8a1b9d5[1b3da0f2...<br/>GENERATED_IDEA]:::idea
    70c7ede4_9724_49e8_ba4d_aca7c9c89a93[70c7ede4...<br/>GENERATED_IDEA]:::idea
    f68ccddc_7010_455d_b7b3_1d8abd3520b8[f68ccddc...<br/>GENERATED_IDEA]:::idea
    30ba3bc3_a6c9_4441_b394_2ada03595dfe[30ba3bc3...<br/>GENERATED_IDEA]:::idea
    SEED_EXEC_test_iter6[SEED_EXE...<br/>SEED_EXECUTION]
    2ecf5864_8b2a_454c_8646_f78e1d63e381[2ecf5864...<br/>SEED_IDEA]:::seed
    SEED_EXEC_test_iter7[SEED_EXE...<br/>SEED_EXECUTION]
    0f6d69c9_d2c3_4f0d_ab68_3e4ccab6a902[0f6d69c9...<br/>SEED_IDEA]:::seed
    SEED_EXEC_test_iter8[SEED_EXE...<br/>SEED_EXECUTION]
    9d82c2ff_9bc0_434f_8f71_3d11bf8f49bd[9d82c2ff...<br/>SEED_IDEA]:::seed
    SEED_EXEC_test_iter9[SEED_EXE...<br/>SEED_EXECUTION]
    d46b9652_fd85_411e_a551_5e895143db21[d46b9652...<br/>SEED_IDEA]:::seed
    SEED_EXEC_test_iter10[SEED_EXE...<br/>SEED_EXECUTION]
    96a5da9c_604f_42b4_94cd_c8145def6bc2[96a5da9c...<br/>SEED_IDEA]:::seed
    8554b35e_19a2_41f6_95e2_a95551ad7ca5 -->|GENERATES| ed7ffedb_5e16_4747_9ab5_4ac2f7162a47
    8554b35e_19a2_41f6_95e2_a95551ad7ca5 -->|GENERATES| d67bd81f_f7ac_487f_beb6_c30897c2f5fb
    8554b35e_19a2_41f6_95e2_a95551ad7ca5 -->|GENERATES| e7b8a30d_31a5_4a69_858d_f7ddec3cdd00
    7812edff_fea4_44db_a49a_3f667fac0a5e -->|GENERATES| 5ffd6e89_af76_4384_a163_89ac71872059
    7812edff_fea4_44db_a49a_3f667fac0a5e -->|GENERATES| 5ffd6e89_af76_4384_a163_89ac71872059
    7812edff_fea4_44db_a49a_3f667fac0a5e -->|GENERATES| 5ffd6e89_af76_4384_a163_89ac71872059
    7812edff_fea4_44db_a49a_3f667fac0a5e -->|GENERATES| 5ffd6e89_af76_4384_a163_89ac71872059
    7812edff_fea4_44db_a49a_3f667fac0a5e -->|GENERATES| 5ffd6e89_af76_4384_a163_89ac71872059
    7812edff_fea4_44db_a49a_3f667fac0a5e -->|GENERATES| ba8ab85d_b887_424f_8e4f_e2aa74128aa9
    7812edff_fea4_44db_a49a_3f667fac0a5e -->|GENERATES| ba8ab85d_b887_424f_8e4f_e2aa74128aa9
    7812edff_fea4_44db_a49a_3f667fac0a5e -->|GENERATES| ba8ab85d_b887_424f_8e4f_e2aa74128aa9
    7812edff_fea4_44db_a49a_3f667fac0a5e -->|GENERATES| ba8ab85d_b887_424f_8e4f_e2aa74128aa9
    7812edff_fea4_44db_a49a_3f667fac0a5e -->|GENERATES| ba8ab85d_b887_424f_8e4f_e2aa74128aa9
    7812edff_fea4_44db_a49a_3f667fac0a5e -->|GENERATES| fbbc3167_fd49_4182_94e6_80e630adc60e
    7812edff_fea4_44db_a49a_3f667fac0a5e -->|GENERATES| fbbc3167_fd49_4182_94e6_80e630adc60e
    7812edff_fea4_44db_a49a_3f667fac0a5e -->|GENERATES| fbbc3167_fd49_4182_94e6_80e630adc60e
    7812edff_fea4_44db_a49a_3f667fac0a5e -->|GENERATES| fbbc3167_fd49_4182_94e6_80e630adc60e
    7812edff_fea4_44db_a49a_3f667fac0a5e -->|GENERATES| fbbc3167_fd49_4182_94e6_80e630adc60e
    aba35ab9_c360_43e4_911a_6a153bb51778 -->|GENERATES| 617791d6_8424_46ee_b794_6ea8decc058d
    aba35ab9_c360_43e4_911a_6a153bb51778 -->|GENERATES| 617791d6_8424_46ee_b794_6ea8decc058d
    aba35ab9_c360_43e4_911a_6a153bb51778 -->|GENERATES| 617791d6_8424_46ee_b794_6ea8decc058d
    aba35ab9_c360_43e4_911a_6a153bb51778 -->|GENERATES| 617791d6_8424_46ee_b794_6ea8decc058d
    aba35ab9_c360_43e4_911a_6a153bb51778 -->|GENERATES| 617791d6_8424_46ee_b794_6ea8decc058d
    aba35ab9_c360_43e4_911a_6a153bb51778 -->|GENERATES| 3cfb18b4_6b1e_4f20_ba02_3a32516ae88e
    aba35ab9_c360_43e4_911a_6a153bb51778 -->|GENERATES| 3cfb18b4_6b1e_4f20_ba02_3a32516ae88e
    aba35ab9_c360_43e4_911a_6a153bb51778 -->|GENERATES| 3cfb18b4_6b1e_4f20_ba02_3a32516ae88e
    aba35ab9_c360_43e4_911a_6a153bb51778 -->|GENERATES| 3cfb18b4_6b1e_4f20_ba02_3a32516ae88e
    aba35ab9_c360_43e4_911a_6a153bb51778 -->|GENERATES| 3cfb18b4_6b1e_4f20_ba02_3a32516ae88e
    aba35ab9_c360_43e4_911a_6a153bb51778 -->|GENERATES| 29ed6bde_747a_471f_9aee_438581f65b94
    aba35ab9_c360_43e4_911a_6a153bb51778 -->|GENERATES| 29ed6bde_747a_471f_9aee_438581f65b94
    aba35ab9_c360_43e4_911a_6a153bb51778 -->|GENERATES| 29ed6bde_747a_471f_9aee_438581f65b94
    aba35ab9_c360_43e4_911a_6a153bb51778 -->|GENERATES| 29ed6bde_747a_471f_9aee_438581f65b94
    aba35ab9_c360_43e4_911a_6a153bb51778 -->|GENERATES| 29ed6bde_747a_471f_9aee_438581f65b94
    1b1a541b_1452_46e7_8e7c_42d4e337a3cc -->|GENERATES| 6a983762_843c_4568_b0bd_ee52367c0b4b
    1b1a541b_1452_46e7_8e7c_42d4e337a3cc -->|GENERATES| 6a983762_843c_4568_b0bd_ee52367c0b4b
    1b1a541b_1452_46e7_8e7c_42d4e337a3cc -->|GENERATES| 6a983762_843c_4568_b0bd_ee52367c0b4b
    1b1a541b_1452_46e7_8e7c_42d4e337a3cc -->|GENERATES| 6a983762_843c_4568_b0bd_ee52367c0b4b
    1b1a541b_1452_46e7_8e7c_42d4e337a3cc -->|GENERATES| 6a983762_843c_4568_b0bd_ee52367c0b4b
    1b1a541b_1452_46e7_8e7c_42d4e337a3cc -->|GENERATES| b4be9432_9ae9_4142_9ae3_6b9ae6fc924f
    1b1a541b_1452_46e7_8e7c_42d4e337a3cc -->|GENERATES| b4be9432_9ae9_4142_9ae3_6b9ae6fc924f
    1b1a541b_1452_46e7_8e7c_42d4e337a3cc -->|GENERATES| b4be9432_9ae9_4142_9ae3_6b9ae6fc924f
    1b1a541b_1452_46e7_8e7c_42d4e337a3cc -->|GENERATES| b4be9432_9ae9_4142_9ae3_6b9ae6fc924f
    1b1a541b_1452_46e7_8e7c_42d4e337a3cc -->|GENERATES| b4be9432_9ae9_4142_9ae3_6b9ae6fc924f
    1b1a541b_1452_46e7_8e7c_42d4e337a3cc -->|GENERATES| 1b3da0f2_3373_4753_a9f1_2d3ac8a1b9d5
    1b1a541b_1452_46e7_8e7c_42d4e337a3cc -->|GENERATES| 1b3da0f2_3373_4753_a9f1_2d3ac8a1b9d5
    1b1a541b_1452_46e7_8e7c_42d4e337a3cc -->|GENERATES| 1b3da0f2_3373_4753_a9f1_2d3ac8a1b9d5
    1b1a541b_1452_46e7_8e7c_42d4e337a3cc -->|GENERATES| 1b3da0f2_3373_4753_a9f1_2d3ac8a1b9d5
    1b1a541b_1452_46e7_8e7c_42d4e337a3cc -->|GENERATES| 1b3da0f2_3373_4753_a9f1_2d3ac8a1b9d5
    9a812053_6483_43a6_8622_c411f5b079e3 -->|GENERATES| 70c7ede4_9724_49e8_ba4d_aca7c9c89a93
    9a812053_6483_43a6_8622_c411f5b079e3 -->|GENERATES| 70c7ede4_9724_49e8_ba4d_aca7c9c89a93
    9a812053_6483_43a6_8622_c411f5b079e3 -->|GENERATES| 70c7ede4_9724_49e8_ba4d_aca7c9c89a93
    9a812053_6483_43a6_8622_c411f5b079e3 -->|GENERATES| 70c7ede4_9724_49e8_ba4d_aca7c9c89a93
    9a812053_6483_43a6_8622_c411f5b079e3 -->|GENERATES| 70c7ede4_9724_49e8_ba4d_aca7c9c89a93
    9a812053_6483_43a6_8622_c411f5b079e3 -->|GENERATES| f68ccddc_7010_455d_b7b3_1d8abd3520b8
    9a812053_6483_43a6_8622_c411f5b079e3 -->|GENERATES| f68ccddc_7010_455d_b7b3_1d8abd3520b8
    9a812053_6483_43a6_8622_c411f5b079e3 -->|GENERATES| f68ccddc_7010_455d_b7b3_1d8abd3520b8
    9a812053_6483_43a6_8622_c411f5b079e3 -->|GENERATES| f68ccddc_7010_455d_b7b3_1d8abd3520b8
    9a812053_6483_43a6_8622_c411f5b079e3 -->|GENERATES| f68ccddc_7010_455d_b7b3_1d8abd3520b8
    9a812053_6483_43a6_8622_c411f5b079e3 -->|GENERATES| 30ba3bc3_a6c9_4441_b394_2ada03595dfe
    9a812053_6483_43a6_8622_c411f5b079e3 -->|GENERATES| 30ba3bc3_a6c9_4441_b394_2ada03595dfe
    9a812053_6483_43a6_8622_c411f5b079e3 -->|GENERATES| 30ba3bc3_a6c9_4441_b394_2ada03595dfe
    9a812053_6483_43a6_8622_c411f5b079e3 -->|GENERATES| 30ba3bc3_a6c9_4441_b394_2ada03595dfe
    9a812053_6483_43a6_8622_c411f5b079e3 -->|GENERATES| 30ba3bc3_a6c9_4441_b394_2ada03595dfe

    classDef seed fill:#90EE90,stroke:#333,stroke-width:2px;
    classDef idea fill:#ADD8E6,stroke:#333,stroke-width:2px;
    classDef proto fill:#FFA500,stroke:#333,stroke-width:2px;
    classDef component fill:#FFB6C1,stroke:#333,stroke-width:2px;
